## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:114" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:114" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:becd9307ecdf027a9929099a9e69496166b5215b46eb88bb095ec80d689732b1" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:052b1d40b99f5a468e22634008641b33323ac6b94c37dca5cf2bcc49f6980800"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 114 -> (known after apply)
-       tags                     = {} -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-graphql must be replaced
+/- resource "aws_s3_object" "lambda_artifact-graphql" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/graphql.3bbb7bde98cb663153ad30ddbcb8e6dd.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "c1eb6c4582c14c88518755fd68d51e7d-6" -> "744634c3f1dc482a7d2f0daa8bb0c7fb"
      ~ id                     = "graphql.3bbb7bde98cb663153ad30ddbcb8e6dd.zip" -> (known after apply)
      ~ key                    = "graphql.3bbb7bde98cb663153ad30ddbcb8e6dd.zip" -> "graphql.744634c3f1dc482a7d2f0daa8bb0c7fb.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "3bbb7bde98cb663153ad30ddbcb8e6dd" -> "744634c3f1dc482a7d2f0daa8bb0c7fb"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "GqoDkIQ2TWpmgHdCHpYUkPE02qFknxUK" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-processValidationJson must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-processValidationJson" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/processValidationJson.0f990cba3fe4ecb7aa57e3238c68fa76.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "e6589ecdec5df2315bd2c4a6fd6c1e54-5" -> "49f6291dc84bb27b95f10c7de8148425"
      ~ id                     = "processValidationJson.0f990cba3fe4ecb7aa57e3238c68fa76.zip" -> (known after apply)
      ~ key                    = "processValidationJson.0f990cba3fe4ecb7aa57e3238c68fa76.zip" -> "processValidationJson.49f6291dc84bb27b95f10c7de8148425.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "0f990cba3fe4ecb7aa57e3238c68fa76" -> "49f6291dc84bb27b95f10c7de8148425"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "n5_2GpFITKmcXOL49jcWOtUBRePgXNQb" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-python must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-python" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/python.2ce22a9472d9dba3437f7ce09a64559d.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "9363b0303f72125f4898124431754d2f-4" -> "3f0a8766551adeeab56b68923e269fd1"
      ~ id                     = "python.2ce22a9472d9dba3437f7ce09a64559d.zip" -> (known after apply)
      ~ key                    = "python.2ce22a9472d9dba3437f7ce09a64559d.zip" -> "python.3f0a8766551adeeab56b68923e269fd1.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "2ce22a9472d9dba3437f7ce09a64559d" -> "3f0a8766551adeeab56b68923e269fd1"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "EX4sf2GYnKc3sM8SCP5srMVAk4fPQKL6" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "9ee577c9487d576a5519ef236e2f1db9" -> "377c150067e791ce9d7249b2eaa636d7"
        id                     = "dist/200.html"
      ~ source_hash            = "9ee577c9487d576a5519ef236e2f1db9" -> "377c150067e791ce9d7249b2eaa636d7"
        tags                   = {}
      ~ version_id             = "Epi542JUlomlnGmm1K_2K9olMCMg9Hbc" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "531e9897073fc50c3ced5495ac8a68b0" -> "9a43d70f8c8706c01245e7b58a3045f0"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "531e9897073fc50c3ced5495ac8a68b0" -> "9a43d70f8c8706c01245e7b58a3045f0"
        tags                   = {}
      ~ version_id             = "dz5ONrfbaooJIyaQ8RzY0S_zXMggd0Dh" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "68b6718b2e12548a53421f078126e1c0" -> "d5d5df862914f6c512281c6cc282511b"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "68b6718b2e12548a53421f078126e1c0" -> "d5d5df862914f6c512281c6cc282511b"
        tags                   = {}
      ~ version_id             = "mc81GTYqDmXEbQPco3vTQSBYcdTFqqJT" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "9ee577c9487d576a5519ef236e2f1db9" -> "377c150067e791ce9d7249b2eaa636d7"
        id                     = "dist/index.html"
      ~ source_hash            = "9ee577c9487d576a5519ef236e2f1db9" -> "377c150067e791ce9d7249b2eaa636d7"
        tags                   = {}
      ~ version_id             = "5vKpCK5LwoPsPgDZaAlU3Sk.ibE0JSzV" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.57d3e404.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "d59a21b61b1cc42702764173a35f9181"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.57d3e404.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.57d3e404.js"
+       source_hash            = "d59a21b61b1cc42702764173a35f9181"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.57d3e404.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "b703266ba347d460c07ac79899e011fa"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.57d3e404.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.57d3e404.js.LICENSE.txt"
+       source_hash            = "b703266ba347d460c07ac79899e011fa"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.5842b81a.js"] will be destroyed
  # (because key ["static/js/app.5842b81a.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.5842b81a.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "a89c108b5ae55d0d06b819d94fd3e989" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.5842b81a.js" -> null
-       key                    = "dist/static/js/app.5842b81a.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.5842b81a.js" -> null
-       source_hash            = "a89c108b5ae55d0d06b819d94fd3e989" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "_tCfv1tPTVwg4xT3BM0ObCHUF1k2KcEz" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.5842b81a.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.5842b81a.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.5842b81a.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "b703266ba347d460c07ac79899e011fa" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.5842b81a.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.5842b81a.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.5842b81a.js.LICENSE.txt" -> null
-       source_hash            = "b703266ba347d460c07ac79899e011fa" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "aA4RkdLXzq9NtHO2rM7ojndfICxNxnqo" -> null
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ last_modified                  = "2024-04-25T14:17:16.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:81" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:81/invocations" -> (known after apply)
      ~ s3_key                         = "python.2ce22a9472d9dba3437f7ce09a64559d.zip" -> "python.3f0a8766551adeeab56b68923e269fd1.zip"
        tags                           = {}
      ~ version                        = "81" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "a0edfd55e7440ba55b99370c437b9e473b2cb820" -> "e2f5a7bd5f694f63da45a258cb139e7812c18e6a"
              ~ "DD_TAGS"                      = "git.commit.sha:a0edfd55e7440ba55b99370c437b9e473b2cb820,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:e2f5a7bd5f694f63da45a258cb139e7812c18e6a,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "a0edfd55e7440ba55b99370c437b9e473b2cb820" -> "e2f5a7bd5f694f63da45a258cb139e7812c18e6a"
                # (14 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "81" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ last_modified                  = "2024-04-25T14:17:02.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:129" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:129/invocations" -> (known after apply)
      ~ s3_key                         = "graphql.3bbb7bde98cb663153ad30ddbcb8e6dd.zip" -> "graphql.744634c3f1dc482a7d2f0daa8bb0c7fb.zip"
        tags                           = {}
      ~ version                        = "129" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "a0edfd55e7440ba55b99370c437b9e473b2cb820" -> "e2f5a7bd5f694f63da45a258cb139e7812c18e6a"
              ~ "DD_TAGS"                            = "git.commit.sha:a0edfd55e7440ba55b99370c437b9e473b2cb820,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:e2f5a7bd5f694f63da45a258cb139e7812c18e6a,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "a0edfd55e7440ba55b99370c437b9e473b2cb820" -> "e2f5a7bd5f694f63da45a258cb139e7812c18e6a"
                # (17 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "129" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-processValidationJson"
      ~ last_modified                  = "2024-04-25T14:17:02.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:37" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:37/invocations" -> (known after apply)
      ~ s3_key                         = "processValidationJson.0f990cba3fe4ecb7aa57e3238c68fa76.zip" -> "processValidationJson.49f6291dc84bb27b95f10c7de8148425.zip"
        tags                           = {}
      ~ version                        = "37" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "a0edfd55e7440ba55b99370c437b9e473b2cb820" -> "e2f5a7bd5f694f63da45a258cb139e7812c18e6a"
              ~ "DD_TAGS"                            = "git.commit.sha:a0edfd55e7440ba55b99370c437b9e473b2cb820,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:e2f5a7bd5f694f63da45a258cb139e7812c18e6a,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "a0edfd55e7440ba55b99370c437b9e473b2cb820" -> "e2f5a7bd5f694f63da45a258cb139e7812c18e6a"
                # (16 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "37" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 9 to add, 8 to change, 9 to destroy.
```

</details>

*Pusher: @laurelkorwin, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8838948694)*